In [1]:
import numpy as np
import pandas as pd

In [2]:
df1=pd.DataFrame({'Name':['San Zhang','Si Li'],'Age':[15,20]})
df2=pd.DataFrame({'Name':['Si Li','Wu Wang'],'Gender':['M','F']})
df1.merge(df2,on='Name',how='left')

        Name  Age Gender
0  San Zhang   15    NaN
1      Si Li   20      M

In [3]:
df1=pd.DataFrame({'df1_name':['San Zhang','Si Li'],'Age':[15,20]})
df2=pd.DataFrame({'df2_name':['Si Li','Wu Wang'],'Gender':['M','F']})
df1.merge(df2, left_on='df1_name', right_on='df2_name', how='left')
#两个表中想要连接的列不具备相同的列名，可以通过left_on 和right_on 指定

    df1_name  Age df2_name Gender
0  San Zhang   15      NaN    NaN
1      Si Li   20    Si Li      M

In [4]:
df1 = pd.DataFrame({'Name':['San Zhang'],'Grade':[70]})
df2 = pd.DataFrame({'Name':['San Zhang'],'Grade':[80]})
df1.merge(df2,on='Name',how='left',suffixes=['_Chinese','_Math'])
#两个表中的列出现了重复的列名，那么可以通过suffixes 参数指定

        Name  Grade_Chinese  Grade_Math
0  San Zhang             70          80

In [5]:
df1=pd.DataFrame({'Name':['Si Li','Si Li'],'Class':['one','two'],'Age':[20,15]})
df2=pd.DataFrame({'Name':['Si Li','Si Li'],'Class':['two','one'],'Gender':['M','F']})
df1.merge(df2,on=['Name','Class'],how='left')
#在某些时候出现重复元素是麻烦的，例如两位同学来自不同的班级，但是姓名相同，这种时候就要指定on参数为多个列使得正确连接：

    Name Class  Age Gender
0  Si Li   one   20      F
1  Si Li   two   15      M

In [6]:
df1 = pd.DataFrame({'Age':[20,15]},index=pd.MultiIndex.from_arrays([['Si Li','Si Li'],['one','two']],names=['Name','Class']))
df2 = pd.DataFrame({'Gender':['F','M']},index=pd.MultiIndex.from_arrays([['Si Li','Si Li'],['one','two']],names=['Name','Class']))
df1.join(df2)

             Age Gender
Name  Class
Si Li one     20      F
      two     15      M

In [7]:
#索引连接
df1 = pd.DataFrame({'Age':[20,30]},
                   index=pd.Series(['San Zhang','Si Li'],
                                   name='Name'))
df2 = pd.DataFrame({'Gender':['M','F']},
                   index=pd.Series(['San Zhang','Si Li'],
                                   name='Name'))
df1.join(df2,how='left')

           Age Gender
Name
San Zhang   20      M
Si Li       30      F

In [8]:
#pandas 中利用join 函数来处理索引连接，它的参数选择要少于merge ，除了必须的on 和how 之外，可以对重复的列指定左右后缀lsuffix 和rsuffix
df1 = pd.DataFrame({'Grade':[70]},index=pd.Series(['San Zhang'],name='Name'))
df2 = pd.DataFrame({'Grade':[80]},index=pd.Series(['San Zhang'],name='Name'))
df1.join(df2,how='left',lsuffix='_Math',rsuffix='_Chinese')

           Grade_Math  Grade_Chinese
Name
San Zhang          70             80

In [9]:
df1 = pd.DataFrame({'Age':[20,21]},
                   index=pd.MultiIndex.from_arrays([['San Zhang', 'San Zhang'],['one', 'two']],
                    names=('Name','Class')))
#创建多级索引
df2 = pd.DataFrame({'Gender':['M','F']},
                   index=pd.MultiIndex.from_arrays([['San Zhang', 'San Zhang'],['one', 'two']],
                    names=('Name','Class')))
df1.join(df2)

                 Age Gender
Name      Class
San Zhang one     20      M
          two     21      F

In [10]:
#方向连接
#把两个表或者多个表按照纵向或者横向拼接，为这种需求，pandas 中提供了concat 函数来实现
#axis, join, keys 分别表示拼接方向，连接形式，以及在新表中指示来自于哪一张旧表的名字
df1 = pd.DataFrame({'Name':['San Zhang','Si Li'],'Age':[20,18]})
df2 = pd.DataFrame({'Name':'Wu Wang','Age':[19]})
pd.concat(objs=[df1,df2])
#在默认状态下的axis=0 ，表示纵向拼接多个表，常常用于多个样本的拼接；而axis=1 表示横向拼接多个表，常用于多个字段或特征的拼接。

        Name  Age
0  San Zhang   20
1      Si Li   18
0    Wu Wang   19

In [11]:
df2 = pd.DataFrame({'Grade':[80,90]})
df3 = pd.DataFrame({'Gender':['M','F']})
pd.concat(objs=[df1,df2,df3],axis=1)

        Name  Age  Grade Gender
0  San Zhang   20     80      M
1      Si Li   18     90      F

In [36]:
df1 = pd.DataFrame({'Name':['San Zhang','Si Li'],'Age':[20,18]})
df2 = pd.DataFrame({'Name':['Wu Wang'], 'Gender':['M']})
pd.concat([df1,df2])

        Name   Age Gender
0  San Zhang  20.0    NaN
1      Si Li  18.0    NaN
0    Wu Wang   NaN      M

In [13]:
df1 = pd.DataFrame({'Name':['San Zhang','Si Li'],'Age':[20,18]})
df2 = pd.DataFrame({'Grade':[80, 90]}, index=[1, 2])
outer = pd.concat([df1,df2],axis=1)
outer

        Name   Age  Grade
0  San Zhang  20.0    NaN
1      Si Li  18.0   80.0
2        NaN   NaN   90.0

In [14]:
df1 = pd.DataFrame({'Name':['San Zhang','Si Li'],'Age':[20,18]})
df2 = pd.DataFrame({'Grade':[80, 90]}, index=[1, 2])
inner = pd.concat([df1,df2],axis=1,join='inner')
inner

    Name  Age  Grade
1  Si Li   18     80

In [23]:
df1 = pd.DataFrame({'Name':['Si Li','San Zhang'],'Age':[20,21]})
df2 = pd.DataFrame({'Name':['Wu Wang'],'Age':19})
pd.concat([df1,df2],keys=['one','two'])

            Name  Age
one 0      Si Li   20
    1  San Zhang   21
two 0    Wu Wang   19

In [24]:
#序列和表的合并
#利用concat 可以实现多个表之间的方向拼接，如果想要把一个序列追加到表的行末或者列末，则可以分别使用append 和assign 方法。
#在append 中，如果原表是默认整数序列的索引，那么可以使用ignore_index=True 对新序列对应索引的自动标号，否则必须对Series 指定name 属性
s = pd.Series(['Wu Wang', 21], index = df1.columns)
df1._append(s,ignore_index = True)

        Name  Age
0      Si Li   20
1  San Zhang   21
2    Wu Wang   21

In [25]:
s_T=s.to_frame().T
res=pd.concat(objs=[s_T,df1],ignore_index = True)
res

        Name Age
0    Wu Wang  21
1      Si Li  20
2  San Zhang  21

In [26]:
#assign可以添加一个新的列，[]的缺点是直接修改，assign返回的是一个临时副本
s=pd.Series([90,80])
df1.assign(Grade=s)

        Name  Age  Grade
0      Si Li   20     90
1  San Zhang   21     80

In [50]:
#类连接
df1 = pd.DataFrame({'Name':['San Zhang','Si Li','Wu Wang'],'Class':['one','two','one'],'Age':[20,15,18]})
df2 = pd.DataFrame({'Name':['San Zhang','Li Si','Wang Wu'],'Class':['one','two','three'],'Age':[20,15,19]})
merge_data = pd.concat([df1,df2])
merge_data.drop_duplicates().set_index('Class')

            Name  Age
Class
one    San Zhang   20
two        Si Li   15
one      Wu Wang   18
two        Li Si   15
three    Wang Wu   19

In [40]:
df1.compare(df2)
#结果中返回了不同值所在的行列，如果相同则会被填充为缺失值NaN ，其中other 和self 分别指代传入的参数表和被调用的表自身。

      Name          Class          Age
      self    other  self  other  self other
1    Si Li    Li Si   NaN    NaN   NaN   NaN
2  Wu Wang  Wang Wu   one  Three  18.0  19.0

In [41]:
df1.compare(df2,keep_shape=True)
# 完整显示表中所有元素的比较情况，可以设置keep_shape=True

      Name          Class          Age
      self    other  self  other  self other
0      NaN      NaN   NaN    NaN   NaN   NaN
1    Si Li    Li Si   NaN    NaN   NaN   NaN
2  Wu Wang  Wang Wu   one  Three  18.0  19.0

In [86]:
df1 = pd.DataFrame({'A':[2,3], 'B':[4,5], 'C':[6,7]})
df1

   A  B  C
0  2  4  6
1  3  5  7

In [87]:
df2 = pd.DataFrame({'B':[5,6], 'C':[7,8], 'D':[9,10]}, index=[1,2])
df2

   B  C   D
1  5  7   9
2  6  8  10

In [88]:
def choose_min(s1, s2):
    s2 = s2.reindex_like(s1)
    res = s1.where(s1<s2, s2)
    res = res.mask(s1.isna()) # isna 表示是否为缺失值，返回布尔序列
    return res

In [89]:
df1.combine(df2,choose_min,overwrite=True)

    A    B    C   D
0 NaN  NaN  NaN NaN
1 NaN  5.0  7.0 NaN
2 NaN  NaN  NaN NaN

In [90]:
df1.combine(df2,choose_min,overwrite=False)

     A    B    C   D
0  2.0  NaN  NaN NaN
1  3.0  5.0  7.0 NaN
2  NaN  NaN  NaN NaN